src/Catalogs/IncomingEmails.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>IncomingEmails</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Sender</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Text</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.IncomingEmailContentType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Comment>The received message ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Mailbox</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/IncomingEmailsState.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>IncomingEmailsState</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Read</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.IncomingEmails</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/IncomingEmailContentType.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>IncomingEmailContentType</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Text</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/IncomingEmails/Forms/ItemForm/Ext/Form/Module.bsl
&AtClient
Procedure Reply(Command)
	FormParameters = New Structure("IncomingEmail", Object.Ref);
	OpenForm("Catalog.OutgoingEmails.ObjectForm", FormParameters);
	Close();
EndProcedure


&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	If Not Parameters.Key.IsEmpty() Then
		Filter = New Structure("Email", Parameters.Key);
		WasRead = InformationRegisters.IncomingEmailsState.Get(Filter).Read;
		If Not WasRead Then
			RS = InformationRegisters.IncomingEmailsState.CreateRecordSet();
			RS.Filter.Email.Set(Parameters.Key);
			Write = RS.Add();
			Write.Email = Parameters.Key;
			Write.Read = True;
			RS.Write();
		EndIf;
		If Object.ContentKind = Enums.IncomingEmailContentType.Text Then
			Text = Object.Text;
			Items.Folder.CurrentPage = Items.TextGroup;
		Else
			HTML = Object.Text;
			Items.Folder.CurrentPage = Items.HTMLGroup;
		EndIf;
	EndIf;		
EndProcedure


&AtClient
Procedure OnOpen(Cancel)
	If Not WasRead Then
		NotifyChanged(Object.Ref);
		//Notify("RefreshIncomingEmailsList");
	EndIf;
EndProcedure
